Revit 2021.1 API
DocumentEntryPoint Methods
The DocumentEntryPoint type exposes the following members.
Methods
Name | Description
AcquireCoordinates
 Acquires coordinates from the specified link instance.
 (Inherited from Document.)
AutoJoinElements
Forces the elements in the Revit document to automatically join to their neighbors where appropriate.
 (Inherited from Document.)
CanEnableCloudWorksharing
 Checks if cloud worksharing can be enabled for the cloud model.
 (Inherited from Document.)
CanEnableWorksharing
 Checks if worksharing can be enabled in the document.
 (Inherited from Document.)
Close()
Closes the document, save the changes if there are.
 (Inherited from Document.)
Close(Boolean)
Closes the document with the option to save.
 (Inherited from Document.)
CombineElements
Combine a set of combinable elements into a geometry combination.
 (Inherited from Document.)
ConvertDetailToModelCurves
Converts a group of DetailCurves to equivalent ModelCurves.
 (Inherited from Document.)
ConvertModelToDetailCurves
Converts a group of ModelCurves to equivalent DetailCurves.
 (Inherited from Document.)
ConvertModelToSymbolicCurves
Converts a group of ModelCurves to equivalent SymbolicCurves.
 (Inherited from Document.)
ConvertSymbolicToModelCurves
Converts a group of SymbolicCurves to equivalent ModelCurves.
 (Inherited from Document.)
Delete(ElementId)
 Deletes an element from the document given the id of that element.
 (Inherited from Document.)
Delete(ICollection<ElementId>)
 Deletes a set of elements from the document.
 (Inherited from Document.)
Dispose |  (Inherited from Document.)
EditFamily
Gets the document of a loaded family to edit.
 (Inherited from Document.)
EnableCloudWorksharing
 Enables cloud worksharing for a cloud model
 (Inherited from Document.)
EnableWorksharing
 Enables worksharing in the document.
 (Inherited from Document.)
Equals
 Determines whether the specified Object equals to this Object.
 (Inherited from Document.)
EraseSchemaAndAllEntities
 Erases Schema and all its Entities from the document.
 (Inherited from Document.)
Export(String, String, MassGBXMLExportOptions)
 Exports a gbXML file from a mass model document.
 (Inherited from Document.)
Export(String, String, GBXMLExportOptions)
 Export the model in gbXML (green-building) format.
 (Inherited from Document.)
Export(String, String, IFCExportOptions)
 Exports the document to the Industry Standard Classes (IFC) format.
 (Inherited from Document.)
Export(String, String, NavisworksExportOptions)
 Exports a Revit project to the Navisworks .nwc format.
 (Inherited from Document.)
Export(String, String, STLExportOptions)
 Exports the document to the STL format.
 (Inherited from Document.)
Export(String, String, ViewSet, DWFExportOptions)
Exports the current view or a selection of views in DWF format.
 (Inherited from Document.)
Export(String, String, ViewSet, DWFXExportOptions)
Exports the current view or a selection of views in DWFX format.
 (Inherited from Document.)
Export(String, String, ViewSet, FBXExportOptions)
Exports the document in 3D-Studio Max (FBX) format.
 (Inherited from Document.)
Export(String, String, ICollection<ElementId>, DGNExportOptions)
 Exports a selection of views in DGN format.
 (Inherited from Document.)
Export(String, String, ICollection<ElementId>, DWGExportOptions)
 Exports a selection of views in DWG format.
 (Inherited from Document.)
Export(String, String, ICollection<ElementId>, DXFExportOptions)
 Exports a selection of views in DXF format.
 (Inherited from Document.)
Export(String, String, ICollection<ElementId>, SATExportOptions)
 Exports the current view or a selection of views in SAT format.
 (Inherited from Document.)
ExportImage
 Exports a view or set of views into an image file.
 (Inherited from Document.)
FinishInitializationEO
 For Revit Macros internal use only.
GetCloudModelPath
 Gets the cloud model path of the cloud model.
 (Inherited from Document.)
GetDefaultElementTypeId
 Gets the default element type id with the given DefaultElementType id.
 (Inherited from Document.)
GetDefaultFamilyTypeId
 Gets the default family type id with the given family category id.
 (Inherited from Document.)
GetDocumentPreviewSettings
 Returns the preview settings for the given document.
 (Inherited from Document.)
GetElement(String)
 Gets the Element referenced by a unique id string.
 (Inherited from Document.)
GetElement(ElementId)
 Gets the Element referenced by the input ElementId.
 (Inherited from Document.)
GetElement(Reference)
 Gets the Element referenced by the input reference.
 (Inherited from Document.)
GetHashCode
 Gets the hash code of this document instance.
 (Inherited from Document.)
GetPaintedMaterial
 Get the material painted on the element's face. Returns invalidElementId if the face is not painted.
 (Inherited from Document.)
GetPrintSettingIds
 Retrieves all Print Settings of current project.
 (Inherited from Document.)
GetRoomAtPoint(XYZ)
Gets a room containing the point.
 (Inherited from Document.)
GetRoomAtPoint(XYZ, Phase)
Gets a room containing the point.
 (Inherited from Document.)
GetSpaceAtPoint(XYZ)
Gets a space containing the point.
 (Inherited from Document.)
GetSpaceAtPoint(XYZ, Phase)
Gets a space containing the point.
 (Inherited from Document.)
GetSubelement(String)
 Gets the subelement referenced by a unique id string.
 (Inherited from Document.)
GetSubelement(Reference)
 Gets the subelement referenced by the input reference.
 (Inherited from Document.)
GetSubelement(ElementId, Int32)
 Gets the subelement referenced by a parent id and subelement id.
 (Inherited from Document.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetUnits
 Gets the Units object.
 (Inherited from Document.)
GetWarnings
 Returns list of failure messages generated from persistent (reviewable) warnings accumulated in the document.
 (Inherited from Document.)
GetWorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Document.)
GetWorksetTable
 Get the WorksetTable of this document.
 (Inherited from Document.)
GetWorksharingCentralModelPath
 Gets the central model path of the worksharing model.
 (Inherited from Document.)
HasAllChangesFromCentral
 Returns whether the model in the current session is up to date with central.
 (Inherited from Document.)
Import(String, GBXMLImportOptions)
Imports a Green-Building XML file into the document.
 (Inherited from Document.)
Import(String, SATImportOptions, View)
 Imports an SAT file into the document.
 (Inherited from Document.)
Import(String, SKPImportOptions, View)
 Imports an SKP file into the document.
 (Inherited from Document.)
Import(String, DGNImportOptions, View, ElementId)
 Imports a DGN file to the document.
 (Inherited from Document.)
Import(String, DWGImportOptions, View, ElementId)
 Imports a DWG or DXF file to the document.
 (Inherited from Document.)
Initialize
 For Revit Macros internal use only.
IsBackgroundCalculationInProgress
 Indicates whether there are any background calculations in progress for this document.
 (Inherited from Document.)
IsDefaultElementTypeIdValid
 Checks whether the element type id is valid for the give DefaultElmentType id.
 (Inherited from Document.)
IsDefaultFamilyTypeIdValid
 Checks whether the family type id is valid for the give family category.
 (Inherited from Document.)
IsPainted
 Checks if the element's face is painted with a material.
 (Inherited from Document.)
Link(String, DWFImportOptions)
 Links Markups in a DWF file into the project document.
 (Inherited from Document.)
Link(String, SATImportOptions, View)
 Links an SAT file into the project document.
 (Inherited from Document.)
Link(String, SKPImportOptions, View)
 Links an SKP file into the project document.
 (Inherited from Document.)
Link(String, DGNImportOptions, View, ElementId)
 Links a DGN file into the project document.
 (Inherited from Document.)
Link(String, DWGImportOptions, View, ElementId)
 Links a DWG or DXF file into the project document.
 (Inherited from Document.)
LoadFamily(String)
Loads an entire family and all its types/symbols into the document.
 (Inherited from Document.)
LoadFamily(Document)
 Loads the contents of this family document into another document.
 (Inherited from Document.)
LoadFamily(String, Family)
Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
 (Inherited from Document.)
LoadFamily(Document, IFamilyLoadOptions)
 Loads the contents of this family document into another document.
 (Inherited from Document.)
LoadFamily(String, IFamilyLoadOptions, Family)
Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
 (Inherited from Document.)
LoadFamilySymbol(String, String)
Loads only a specified family type/symbol from a family file into the document.
 (Inherited from Document.)
LoadFamilySymbol(String, String, FamilySymbol)
Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
 (Inherited from Document.)
LoadFamilySymbol(String, String, IFamilyLoadOptions, FamilySymbol)
Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
 (Inherited from Document.)
MakeTransientElements
 This method encapsulates the process of creating transient elements in the document.
 (Inherited from Document.)
OnShutdownEO
 For Revit Macros internal use only.
Paint(ElementId, Face, ElementId)
 Paint the element's face with specified material.
 (Inherited from Document.)
Paint(ElementId, Face, FamilyParameter)
 Paint the element's face with specified material.
 (Inherited from Document.)
PostFailure
 Posts a failure to be displayed to the user at the end of transaction.
 (Inherited from Document.)
Print(ViewSet)
Prints a set of views with default view template and default print settings.
 (Inherited from Document.)
Print(ViewSet, View)
Prints a set of views with a specified view template and default print settings.
 (Inherited from Document.)
Print(ViewSet, Boolean)
Prints a set of views with default view template and default print settings.
 (Inherited from Document.)
Print(ViewSet, View, Boolean)
Prints a set of views with a specified view template and default print settings.
 (Inherited from Document.)
PublishCoordinates
 Publish coordinates to the specified ProjectLocation of the link instance.
 (Inherited from Document.)
Regenerate
Updates the elements in the Revit document to reflect all changes.
 (Inherited from Document.)
ReloadLatest
 Fetches changes from central (due to one or more synchronizations with central) and merges them into the current session.
 (Inherited from Document.)
RemovePaint
 Remove the material painted on the element's face. If the face is currently not painted,it will do nothing.
 (Inherited from Document.)
ResetSharedCoordinates
 Reset shared coordinates for the host model/file.
 (Inherited from Document.)
Save()
 Saves the document.
 (Inherited from Document.)
Save(SaveOptions)
 Saves the document.
 (Inherited from Document.)
SaveAs(String)
 Saves the document to a given file path.
 (Inherited from Document.)
SaveAs(String, SaveAsOptions)
 Saves the document to a given file path.
 (Inherited from Document.)
SaveAs(ModelPath, SaveAsOptions)
 Saves the document to a given path.
 (Inherited from Document.)
SaveAsCloudModel(String, String) |  Obsolete.
 Saves current nonworkshared model as a cloud model in BIM 360.
 (Inherited from Document.)
SaveAsCloudModel(Guid, Guid, String, String)
 Saves current nonworkshared model as a cloud model in BIM 360.
 (Inherited from Document.)
SaveCloudModel
 Saves cloud model.
 (Inherited from Document.)
SaveToProjectAsImage
 Creates an image view from the currently active view.
 (Inherited from Document.)
SeparateElements
Separate a set of combinable elements out of combinations they currently belong to.
 (Inherited from Document.)
SetDefaultElementTypeId
 Sets the default element type id of the given DefaultElementType id.
 (Inherited from Document.)
SetDefaultFamilyTypeId
 Sets the default family type id for the given family category.
 (Inherited from Document.)
SetUnits
 Sets the units.
 (Inherited from Document.)
SynchronizeWithCentral
 Performs reload latest until the model in the current session is up to date and then saves changes back to central. A save to central is performed even if no changes were made.
 (Inherited from Document.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
UnpostFailure
 Deletes the posted failure message associated with a given FailureMessageKey.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
Autodesk.Revit.DB.Macros Namespace